import {TELEGRAM, PHONE, MESSENGER, SMS} from './contact_constant';

export const mentalSupportContacts = [
  {
    name: "បណ្ដាញទូរស័ទ្ទជំនួយកុមារកម្ពុជា(1280)",
    intend: "tel:1280",
    channel: PHONE,
    errorMessage: "មិនអាចធ្វើការទំនាក់ទំនងជាមួយលេខទូរស័ព្ទនេះបានទេ។ សូមធ្វើការពិនិត្យមើលថាតើឧបករណ៍របស់អ្នកអាចធ្វើការហៅចេញតាមប្រព័ន្ធទូរស័ព្ទបាន។"
  },
  {
    name: "បណ្ដាញទូរស័ទ្ទជំនួយកុមារកម្ពុជា(1280)",
    intend: "sms:1280",
    channel: SMS,
    errorMessage: "មិនអាចធ្វើការទំនាក់ទំនងជាមួយសារ SMS នេះបានទេ។ សូមធ្វើការពិនិត្យមើលថាតើឧបករណ៍របស់អ្នកអាចធ្វើការផ្ញើសារ SMS បាន។",
  },
  {
    name: "បណ្ដាញទូរស័ទ្ទជំនួយកុមារកម្ពុជា(1280)",
    intend: "http://m.me/chc1280",
    channel: MESSENGER,
    errorMessage: "មិនអាចធ្វើការទំនាក់ទំនងជាមួយ Messenger នេះបានទេ។ សូមធ្វើការពិនិត្យមើលថាតើឧបករណ៍របស់អ្នកមានតំឡើងកម្មវិធី Messenger រួចហើយ។"
  },
  {
    name: "បណ្ដាញទូរស័ទ្ទជំនួយកុមារកម្ពុជា(1280)",
    intend: "https://t.me/chc1280",
    channel: TELEGRAM,
    errorMessage: "មិនអាចធ្វើការទំនាក់ទំនងជាមួយតេឡេក្រាមនេះបានទេ។ សូមធ្វើការពិនិត្យមើលថាតើឧបករណ៍របស់អ្នកមានតំឡើងកម្មវិធីតេឡេក្រាមរួចហើយ។"
  },
]